{
  "items": [
    {
      "id": "1",
      "title": "Shoot Straight: One Fall win the 2023 Rock and Roll Rumble",
      "outline": "The Salem group was quick to shred the evening’s final competing set into epic snapshots: Pleather boots perched on monitors, sweaty locks of hair tossed back and snapped forward, concentration funneled into fast fingers skating across a golden Gibson. And good luck to anyone trying to take a photo whenever lead singer and guitarist Helen McWilliams punched a riotous fist in the air, causing a legion of North Shore devotees to follow suit right in front of every camera lens.",
      "publisher": "Vanyaland",
      "publishDate": "2023-05-07T20:00:00.199Z",
      "publishUrl": "https://vanyaland.com/2023/05/07/shoot-straight-one-fall-win-the-2023-rock-and-roll-rumble/",
      "imageUrl": "https://raw.githubusercontent.com/naumch1k/misc/main/images/one-fall/press-vanyaland-2023-05-07.jpg"
    },
    {
      "id": "2",
      "title": "Witch City Rockers: ONE FALL scores smackdown at Rumble, plays hometown show",
      "outline": "If you catch the reference in the band name ONE FALL, the melodic punk rockers’ music will make perfect sense… Regardless of genre or labels, ONE FALL’s sound captures some of the attributes of pro wrasslin’ with its high-energy.",
      "publisher": "Salem News",
      "publishDate": "2023-06-27T20:00:00.199Z",
      "publishUrl": "https://www.salemnews.com/news/witch-city-rockers-one-fall-scores-smackdown-at-rumble-plays-hometown-show/article_b3b7ab16-f9a8-11ed-8d09-234744b47b02.html",
      "imageUrl": "https://raw.githubusercontent.com/naumch1k/misc/main/images/one-fall/press-salem-news-2023-06-27.jpg"
    },
    {
      "id": "3",
      "title": "Are you read to (Rock & Roll) Rumble?",
      "outline": "If you like melodic punk – and c’mon, who doesn’t – the Salem quartet will slay you. Helen McWilliams voice has never, ever sounded better than on “Rats Abandon Ship.” It’s impossibly big and framed so expertly by a tidal wave of sneering, cheering hooky punk guitars and drums.",
      "publisher": "Boston Herald",
      "publishDate": "2023-04-02T00:47:00.199Z",
      "publishUrl": "https://www.bostonherald.com/2023/04/02/are-you-read-to-rock-roll-rumble/",
      "imageUrl": "https://raw.githubusercontent.com/naumch1k/misc/main/images/one-fall/press-boston-herald-2023-04-02.jpg"
    },
    {
      "id": "4",
      "title": "RNRF X Rock & Roll Rumble: Semi-Finals, Night 2 Live Recap/Review",
      "outline": "One Fall delivered an energetic set that mixed an Old School NYHC aesthetic with West Coast Punk vibe as vocalist/rhythm guitarist Helen McWilliams launched into a Davey Havok meets Glenn Danzig hybrid behind the mic as they ripped through a stellar set…",
      "publisher": "Rock And Roll Fables",
      "publishDate": "2023-04-26T20:00:00.199Z",
      "publishUrl": "https://rockandrollfables.com/rnrf-x-rock-roll-rumble-semi-finals-night-2-live-recap-review/#more-17006",
      "imageUrl": "https://raw.githubusercontent.com/naumch1k/misc/main/images/one-fall/press-rock-roll-fables-2023-04-26.jpg"
    },
    {
      "id": "5",
      "title": "One Fall - s/t",
      "outline": "One Fall is a Salem, MA punk rock supergroup. The band just released their debut three song EP, and to call it melodic hardcore is an understatement. Musically ‘Slingshot’, ‘Rats Abandon Ship’... fit squarely into the melodic hardcore genre. It's loud and hard like hardcore should be, but there is still a melodic element throughout the songs. It's not just fast and loud, but it's catchy as hell. And then there's the vocals. McWilliams has a voice not typically heard in music this loud. It's more of a pop style of vocal, but somehow One Fall make it work with the more aggressive music. Plus, there is some crazy great harmonizing going on here, the kind you'd normally hear with a band like The Beths than punk or hardcore.",
      "publisher": "If It’s Too Loud",
      "publishDate": "2022-11-08T20:00:00.199Z",
      "publishUrl": "http://www.ifitstooloud.com/2022/11/one-fall-st.html",
      "imageUrl": "https://raw.githubusercontent.com/naumch1k/misc/main/images/one-fall/press-if-its-too-loud-2022-11-08.jpg"
    },
    {
      "id": "6",
      "title": "V3 Weekend: ONE FALL, Eugene Mirman, GRRL HAUS CINEMA",
      "outline": "The new melodic punk quartet out of Salem dropped a lightning bolt of a self-titled EP last month, boast some significant Boston music DNA (Razors in the Night, Giant Target…), and are fronted by do-no-wrong vocalist and rhythm guitarist Helen McWilliams (Tijuana Sweetheart). ONE FALL’s three-track EP, a polished hit machine recorded and mixed by Kyle Paradis, is a high-energy punk powderkeg that’s both brash and inviting, packing the type of infectious ragers that squat in your dome and refuse to vacate.",
      "publisher": "Vanyaland",
      "publishDate": "2022-12-09T20:00:00.199Z",
      "publishUrl": "https://vanyaland.com/2022/12/09/v3-weekend-one-fall-eugene-mirman-grrlhaus-cinema/",
      "imageUrl": "https://raw.githubusercontent.com/naumch1k/misc/main/images/one-fall/press-vanyaland-2022-12-09.jpg"
    }
  ]
}
